hungryturtle-one/servo_controller/servo_controller.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L5
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
RCC.MSI_VALUE=4000000
ProjectManager.MainLocation=Core/Src
NVIC1.BFHFNMINS=0
PA15\ (JTDI).GPIOParameters=PinAttribute
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PLLQoutputFreq_Value=16000000
ProjectManager.ProjectFileName=servo_controller.ioc
RCC.SAI1Freq_Value=4571428.571428572
SH.S_TIM2_CH1.0=TIM2_CH1,PWM Generation1 CH1
VP_GTZC_VS_GTZC_Enable.Mode=GTZC_Enable
ProjectManager.KeepUserCode=true
Mcu.PinsNb=11
Mcu.UserName=STM32L562QEIxQ
ProjectManager.NoMain=false
NVIC2.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PC13.Signal=RTC_TS
NVIC1.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PLLSAI1RoutputFreq_Value=16000000
NVIC2.BFHFNMINS=0
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true-CortexM33S,2-SystemClock_Config-RCC-false-HAL-false-CortexM33S,3-MX_GTZC_Init-GTZC-false-HAL-true-CortexM33S,4-MX_RTC_Init-RTC-false-HAL-true-CortexM33S,5-MX_TIM2_Init-TIM2-false-HAL-true-CortexM33S,1-SystemClock_Config-RCC-false-HAL-false-CortexM33NS,2-MX_RTC_Init-RTC-false-HAL-true-CortexM33NS,0-MX_PWR_Init-PWR-false-HAL-true-CortexM33S,0-MX_PWR_Init-PWR-false-HAL-true-CortexM33NS
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
CortexM33S.IPs=DMA\:I,GTZC\:I,NVIC1\:I,OTFDEC1\:I,PWR\:I,RCC\:I,RTC\:I,SYS_S\:I,TAMP\:I,TIM2\:I
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_3
VP_SYS_S_VS_Systick.Signal=SYS_S_VS_Systick
ProjectManager.DefaultFWLocation=true
PA15\ (JTDI).PinAttribute=CortexM33S
PA15\ (JTDI).Signal=S_TIM2_CH1
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
ProjectManager.DeletePrevious=true
RCC.VCOSAI2OutputFreq_Value=32000000
PB15.Signal=RTC_REFIN
PinOutPanel.RotationAngle=0
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
ProjectManager.StackSize=0x400
RCC.SecureElements=RTCClkSource
RCC.VCOInput3Freq_Value=4000000
SYS.userName=SYS_NS
Mcu.IP4=RCC
PB2.PinAttribute=CortexM33S
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP5=RTC
VP_SYS_S_VS_Systick.Mode=SysTick
Mcu.IP2=NVIC1
Mcu.IP3=PWR
Mcu.IP0=GTZC
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP1=NVIC2
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.UserConstants=
RCC.VCOSAI1OutputFreq_Value=32000000
ProjectManager.TargetToolchain=STM32CubeIDE
RCC.SDMMCFreq_Value=4571428.571428572
NVIC1.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.ThirdPartyNb=0
GTZC.TIM2_Secure=GTZC_TZSC_PERIPH_SEC
NVIC2.ForceEnableDMAVector=true
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IPNb=9
TIM2.IPParameters=Channel-PWM Generation1 CH1,Period
ProjectManager.PreviousToolchain=
VP_RTC_VS_RTC_WakeUp_intern.Signal=RTC_VS_RTC_WakeUp_intern
PB2.GPIOParameters=PinAttribute
VP_GTZC_VS_GTZC_Enable.Signal=GTZC_VS_GTZC_Enable
NVIC1.ForceEnableDMAVector=true
CortexM33NS.IPs=DMA,FREERTOS\:I,NVIC2\:I,PWR,RCC,RTC,SYS\:I,TAMP
Mcu.Pin6=VP_RTC_VS_RTC_Activate
RCC.SAI2Freq_Value=4571428.571428572
Mcu.Pin7=VP_RTC_VS_RTC_Calendar
Mcu.Pin8=VP_RTC_VS_RTC_WakeUp_intern
Mcu.Pin9=VP_SYS_VS_Systick
RCC.LSE_VALUE=32768
GTZC.OTFDEC1_Secure=GTZC_TZSC_PERIPH_SEC
RCC.PLLSAI1PoutputFreq_Value=4571428.571428572
Mcu.Pin0=PA15 (JTDI)
Mcu.Pin1=PC13
GPIO.groupedBy=Show All
Mcu.Pin2=PB2
GTZC.IPParameters=OTFDEC1_Secure,TIM2_Secure
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin3=PB15
Mcu.Pin4=VP_GTZC_VS_GTZC_Enable
Mcu.Pin5=VP_PWR_VS_DBSignals
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=16000000
PB2.Signal=RTC_OUT2
board=custom
RCC.VCOOutputFreq_Value=32000000
ProjectManager.LastFirmware=true
PB15.Mode=Reference_Clock_Detection_Activate
ProjectManager.FirmwarePackage=STM32Cube FW_L5 V1.1.0
MxDb.Version=DB.5.0.50
NVIC1.PRIS=0
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_3
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.BackupPrevious=false
MxCube.Version=5.5.0
RCC.VCOInputFreq_Value=4000000
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC13.GPIOParameters=PinAttribute
RCC.FDCANFreq_Value=16000000
RCC.PLLSAI1QoutputFreq_Value=16000000
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
NVIC2.PRIS=0
SH.S_TIM2_CH1.ConfNb=1
RCC.PLLRCLKFreq_Value=16000000
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM2.Period=0
PB15.GPIOParameters=PinAttribute
PC13.Mode=Timestamp enabled
ProjectManager.FreePins=true
RCC.IPParameters=CRSFreq_Value,FDCANFreq_Value,FamilyName,HSE_VALUE,HSI48_VALUE,HSI_VALUE,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MSI_VALUE,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1RoutputFreq_Value,PLLSAI2PoutputFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value,VCOSAI2OutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L562QEIxQ
ProjectManager.HalAssertFull=false
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=servo_controller
ProjectManager.UnderRoot=true
Mcu.IP8=TIM2
PC13.PinAttribute=CortexM33S
Mcu.IP6=SYS
Mcu.IP7=SYS_S
ProjectManager.CoupleFile=true
Mcu.Package=UFBGA132
PB15.PinAttribute=CortexM33S
RCC.PLLSAI2PoutputFreq_Value=4571428.571428572
KeepUserPlacement=false
Mcu.TrustZone=enable
PB2.Mode=Calibration_512Hz
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
ProjectManager.HeapSize=0x200
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
VP_PWR_VS_DBSignals.Mode=DisableDeadBatterySignals
VP_PWR_VS_DBSignals.Signal=PWR_VS_DBSignals
ProjectManager.ComputerToolchain=false
Mcu.Context0=CortexM33S
RCC.HSI_VALUE=16000000
Mcu.Context1=CortexM33NS
VP_RTC_VS_RTC_WakeUp_intern.Mode=WakeUp
RCC.PLLPoutputFreq_Value=4571428.571428572
Mcu.Pin10=VP_SYS_S_VS_Systick
RCC.VCOInput2Freq_Value=4000000
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.ContextNb=2
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32L562QEIxQ
ProjectManager.LibraryCopy=1
RCC.HSI48_VALUE=48000000
isbadioc=false
